doc/org-mode/elements/mobile_panel.org
# vim: ft=org sw=2 ts=2 et
#+TITLE: Mobile Panel Element
#+STYLE: <LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />
#+AUTHOR: Jesse Gumm (@jessegumm)
#+OPTIONS:   H:2 num:1 toc:1 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+EMAIL: 
#+TEXT: [[http://nitrogenproject.com][Home]] | [[file:../index.org][Getting Started]] | [[file:../api.org][API]] | [[file:../elements.org][*Elements*]] | [[file:../actions.org][Actions]] | [[file:../validators.org][Validators]] | [[file:../handlers.org][Handlers]] | [[file:../config.org][Configuration Options]] | [[file:../advanced.org][Advanced Guides]] | [[file:../troubleshooting.org][Troubleshooting]] | [[file:../about.org][About]]

* Mobile Panel Element - #mobile\_panel {}

  This element produces a
  [[http://view.jquerymobile.com/1.3.1/dist/demos/widgets/panels/][jQuery Mobile Panel]]
  Element, which is typically used for making mobile-style slide-out menus.

** Usage

#+BEGIN_SRC erlang
  #mobile_panel { 
    display_mode=push,
    body=[
      #h3{text="Menu"},
      "Here is a slide-out side menu"
    ]
  }.
#+END_SRC

** Attributes
   
  + body - (/Nitrogen element or list of elements/) :: Set the element(s) that
    will be rendered within this panel.

  + theme - (/atom/) :: Set the jQuery Mobile swatch letter for the content.
   
  + dismissible - (/boolean/) :: Set to true to allow it to be dismissed with
    the Escape key or clicking outside of the panel contents.

  + position - (/left or right/) :: Tells which side of the screen to place
    the panel. (Default: =left=)

  + display\_mode - (/reveal, push, or overlay/) :: Which way to animate the
    panel into visibility. (Default: =reveal=)

** See Also

  + [[./jquery_mobile.html][jQuery mobile elements]]

  + [[./base.html][base element]]

  + [[file:../actions/toggle_mobile_panel.org][toggle\_mobile\_panel action]]

  + [[http://nitrogenproject.com/demos/mobile_panel][Mobile Panel Demonstration]]
