doc/html/elements/mobile_panel.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Mobile Panel Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Mobile Panel Element"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-11-12 19:50:56 CST"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Mobile Panel Element</h1>

<p><a href="http://nitrogenproject.com">Home</a> | <a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html"><b>Elements</b></a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html">Handlers</a> | <a href="../config.html">Configuration Options</a> | <a href="../advanced.html">Advanced Guides</a> | <a href="../troubleshooting.html">Troubleshooting</a> | <a href="../about.html">About</a>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Mobile Panel Element - #mobile_panel {}</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Mobile Panel Element - #mobile_panel {}</h2>
<div class="outline-text-2" id="text-1">


<p>
  This element produces a
  <a href="http://view.jquerymobile.com/1.3.1/dist/demos/widgets/panels/">jQuery Mobile Panel</a>
  Element, which is typically used for making mobile-style slide-out menus.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Usage</h3>
<div class="outline-text-3" id="text-1-1">





<pre class="src src-erlang">#<span class="org-type">mobile_panel</span> { 
  display_mode=push,
  body=[
    #<span class="org-type">h3</span>{text=<span class="org-string">"Menu"</span>},
    <span class="org-string">"Here is a slide-out side menu"</span>
  ]
}.
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Attributes</h3>
<div class="outline-text-3" id="text-1-2">


<dl>
<dt>body - (<i>Nitrogen element or list of elements</i>)</dt><dd>Set the element(s) that
    will be rendered within this panel.

</dd>
<dt>theme - (<i>atom</i>)</dt><dd>Set the jQuery Mobile swatch letter for the content.

</dd>
<dt>dismissible - (<i>boolean</i>)</dt><dd>Set to true to allow it to be dismissed with
    the Escape key or clicking outside of the panel contents.

</dd>
<dt>position - (<i>left or right</i>)</dt><dd>Tells which side of the screen to place
    the panel. (Default: <code>left</code>)

</dd>
<dt>display_mode - (<i>reveal, push, or overlay</i>)</dt><dd>Which way to animate the
    panel into visibility. (Default: <code>reveal</code>)
</dd>
</dl>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-3">


<ul>
<li><a href="./jquery_mobile.html">jQuery mobile elements</a>

</li>
<li><a href="./base.html">base element</a>

</li>
<li><a href="../actions/toggle_mobile_panel.html">toggle_mobile_panel action</a>

</li>
<li><a href="http://nitrogenproject.com/demos/mobile_panel">Mobile Panel Demonstration</a>
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-11-12 19:50:56 CST</p>
<p class="author">Author: Jesse Gumm (@jessegumm)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/elements/mobile_panel.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
